basic-binary-packet-network.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Network Extension for Basic Binary Packet</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Network Extension for Basic Binary Packet"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-09 20:30:33 EST"/>
<meta name="author" content="Mark Cox"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Network Extension for Basic Binary Packet</h1>

<p>This extension to the basic binary packet library provides
applications with the ability to send packets over a network.
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Installation</a></li>
<li><a href="#sec-2">2 Introduction</a></li>
<li><a href="#sec-3">3 Stream</a></li>
<li><a href="#sec-4">4 Server</a></li>
<li><a href="#sec-5">5 Client</a></li>
<li><a href="#sec-6">6 Advanced API</a>
<ul>
<li><a href="#sec-6-1">6.1 IOLIB</a></li>
<li><a href="#sec-6-2">6.2 Using sockets that are not IPV4.</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">

<p>The prerequisites for this library are
</p><ul>
<li><a href="http://common-lisp.net/project/iolib/"><code>IOLIB</code></a>
</li>
<li><a href="https://github.com/OdonataResearchLLC/lisp-unit">Lisp Unit</a> (tests only)
</li>
</ul>


<p>
The most current version of this library can be obtained from the git repository
</p>


<pre class="src src-sh">git clone &lt;path&gt;
</pre>


<p>
Loading of this library can be achieved by evaluating
</p>


<pre class="src src-lisp">(asdf:load-system <span style="color: #8b2252;">"basic-binary-packet-network"</span>)
</pre>


<p>
A number of tests accompany this extension to ensure it is working
correctly. These tests can be performed by evaluating
</p>


<pre class="src src-lisp">(asdf:test-system <span style="color: #8b2252;">"basic-binary-packet-network"</span>)
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">

<p>This library provides an interface for sending and receiving basic
binary packets over a network. This functionality is divided in to the
following components:
</p><dl>
<dt>Server</dt><dd>Handle new basic binary packet connections.
</dd>
<dt>Client</dt><dd>Establish a new connection to a basic binary packet
            server.
</dd>
<dt>Stream</dt><dd>Manage a stream that can send and receive basic binary
            packets.
</dd>
</dl>


<p>
All of the above components use the asynchronous input and output
functionality provided by <code>IOLIB</code>. The main effect of this choice is
that this library's design shares a number of similarities with
graphical user interface APIs where by callbacks are invoked from
within an event loop. To invoke the basic binary packet event loop
from your application you call the function <code>PROCESS-EVENTS</code>.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defun</span> <span style="color: #0000ff;">process-events</span> (<span style="color: #228b22;">&amp;key</span> one-shot timeout <span style="color: #228b22;">&amp;allow-other-keys</span>))
</pre>

<p>
The keyword argument <code>ONE-SHOT</code> specifies that only one invocation of
the event loop should occur. The keyword argument <code>TIMEOUT</code> specifies
that the event loop should continue to wait and process events until
no event has occurred within <code>TIMEOUT</code> milliseconds.
</p>
<p>
The <code>PROCESS-EVENTS</code> function simply invokes the function
<code>IOLIB:EVENT-DISPATCH</code>. More information on accessing the <code>IOLIB</code>
state is described in the <a href="#sec-6">Advanced API</a> section.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Stream</h2>
<div class="outline-text-2" id="text-3">

<p>The basic binary packet network stream protocol models the behavior of
a communication channel that can send and receive objects using the
basic binary packet protocol. An important characteristic of the
stream is that the order in which objects are received is the same as
the order they were written.
</p>
<p>
The function <code>WRITE-OBJECT</code> sends an <code>OBJECT</code> over the <code>STREAM</code>. The
function <code>FORCE-OUTPUT</code> should be invoked after <code>WRITE-OBJECT</code> if
<code>OBJECT</code> needs to be sent immediately.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">write-object</span> (object stream <span style="color: #228b22;">&amp;key</span> binary-type identifier <span style="color: #228b22;">&amp;allow-other-keys</span>))
</pre>

<p>
The manner in which <code>OBJECT</code> is encoded is controlled by the
<code>BINARY-TYPE</code> argument. The receiver of the sent packet will be able
to identify the packet using the 32-bit unsigned integer
<code>IDENTIFIER</code>. More information on the keyword arguments can be found
in the <a href="basic-binary-packet.html">basic binary packet documentation</a>.
</p>
<p>
It is an error if <code>WRITE-OBJECT</code> is called before the stream is in the
connected state. This can be determined directly using the function
<code>CONNECTEDP</code>.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">connectedp</span> (stream))
</pre>

<p>
An alternative method is to register an <code>ON-CONNECTION</code> callback
function.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">on-connection</span> (stream))
(<span style="color: #7f007f;">defgeneric</span> (<span style="color: #0000ff;">setf on-connection</span>) (function stream))
</pre>

<p>
The callback function is invoked with a single object that is the
stream that has successfully connected to a server.
</p>
<p>
Objects decoded from stream data are obtained via the <code>ON-OBJECT</code>
callback.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">on-object</span> (stream))
(<span style="color: #7f007f;">defgeneric</span> (<span style="color: #0000ff;">setf on-object</span>) (function stream))
</pre>

<p>
The assigned function must accept three arguments, the <code>STREAM</code> that
received the object, the <code>OBJECT</code> that was sent and the packet
<code>IDENTIFIER</code> used to transmit the object.
</p>
<p>
When the stream is no longer required, the function <code>CLOSE</code> can be
used to release all operating system resources needed for network
communication.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">close</span> (stream <span style="color: #228b22;">&amp;key</span> abort <span style="color: #228b22;">&amp;allow-other-keys</span>))  
</pre>


<p>
Any errors that have occurred on a stream object are communicated
using the <code>ON-ERROR</code> callback function.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">on-error</span> (stream))
(<span style="color: #7f007f;">defgeneric</span> (<span style="color: #0000ff;">setf on-error</span>) (function stream))
</pre>

<p>
The <code>ON-ERROR</code> function must accept two arguments, the <code>STREAM</code> in
error and the <code>ERROR</code> condition. The stream is automatically closed
prior to invoking the <code>ON-ERROR</code> function.
</p>
<p>
An <code>END-OF-FILE</code> condition object is used to identify the event where
the communication channel is terminated by the other end of the
stream.
</p>
<p>
The complete list of conditions that can be communicated is defined by
the specific implementation of the stream protocol.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Server</h2>
<div class="outline-text-2" id="text-4">

<p>A basic binary packet network server listens for connections that use
the basic binary packet protocol. Starting a server is achieved by
using the <code>MAKE-SERVER</code> function.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defun</span> <span style="color: #0000ff;">make-server</span> (address port <span style="color: #228b22;">&amp;key</span> reuse-address backlog))
</pre>

<p>
The returned object represents an IPv4 network server that listens for
connections to the port number <code>PORT</code> on the host interface <code>ADDRESS</code>.
The <code>ADDRESS</code> argument is an <code>IOLIB</code> Internet address object and
<code>PORT</code> is an unsigned 16 bit integer. If the keyword argument
<code>REUSE-ADDRESS</code> is true, then <code>MAKE-SERVER</code> will not signal an error
if the <code>ADDRESS</code> and <code>PORT</code> pair were recently used as a server on the
current host. The <code>BACKLOG</code> argument represents the number of pending
unaccepted connections the operating system will hold
available. Exceeding this number results in any new connection being
refused.
</p>
<p>
The object returned by <code>MAKE-SERVER</code> supports a number of functions
that permit interaction with the running server.
</p>
<p>
Notifications of new accepted connections are performed using the
<code>ON-NEW-CONNECTION</code> callback function.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">on-new-connection</span> (server))
(<span style="color: #7f007f;">defgeneric</span> (<span style="color: #0000ff;">setf on-new-connection</span>) (function server))
</pre>

<p>
The callback function must accept two arguments, the <code>SERVER</code> object
that accepted the connection and a <code>STREAM</code> object that implements the
<a href="#sec-3">stream</a> protocol. Please be aware that the <code>STREAM</code> object will not be
in the connected state prior to calling the callback function. The
<a href="#sec-3">stream</a> documentation outlines when the stream is ready for
communication. Lastly, any operation involving the <code>SERVER</code> instance
only applies to the <code>SERVER</code> as the accepted connection is entirely
managed by the newly created <code>STREAM</code> object.
</p>
<p>
Terminating the server is achieved by calling the <code>CLOSE</code> function.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">close</span> (server <span style="color: #228b22;">&amp;key</span> <span style="color: #228b22;">&amp;allow-other-keys</span>))
</pre>


<p>
Notifications of any error involving the server specifically will be
communicated via the <code>ON-ERROR</code> callback.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">on-error</span> (server))
(<span style="color: #7f007f;">defgeneric</span> (<span style="color: #0000ff;">setf on-error</span>) (value server))
</pre>

<p>
The function <code>CLOSE</code> will be invoked on the server object prior to the
notification. The <code>IOLIB</code> documentation is unclear on what type of
errors a server socket will encounter at run time. I will update this
as more detailed information is obtained.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Client</h2>
<div class="outline-text-2" id="text-5">

<p>A basic binary packet client communicates to a server using the basic
binary packet protocol. Connecting to a remote server is performed
using the <code>MAKE-CLIENT</code> function.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defun</span> <span style="color: #0000ff;">make-client</span> (address port))
</pre>

<p>
This function will return an object that is in the process of
connecting to a server listening on port number <code>PORT</code> at Internet
<code>ADDRESS</code>. The <code>PORT</code> argument must be an unsigned 16 bit number and
the <code>ADDRESS</code> argument is an <code>IOLIB</code> address object.
</p>
<p>
The returned object implements the <a href="#sec-3">stream</a> protocol in order to send
and receive objects.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Advanced API</h2>
<div class="outline-text-2" id="text-6">

<p>The advanced API provides access to two aspects of this extension, the
<code>IOLIB</code> event base and expanding the types of stream sockets the
implementation can support.
</p>

</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> IOLIB</h3>
<div class="outline-text-3" id="text-6-1">

<p>The objects returned by <code>MAKE-SERVER</code> and <code>MAKE-CLIENT</code> utilise the
asynchronous API provided by <code>IOLIB</code>. Key to this API is the
<code>IOLIB:EVENT-BASE</code> object. All objects created by in this library
share a single <code>IOLIB:EVENT-BASE</code> object. This object can be obtained
using the <code>*EVENT-BASE*</code> dynamic variable.
</p>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Using sockets that are not IPV4.</h3>
<div class="outline-text-3" id="text-6-2">

<p>I will write this section on request.
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-09 20:30:33 EST</p>
<p class="author">Author: Mark Cox</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
